---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.CurtaingridUseCurveDistU
source: html/29168328-f0bb-e062-3a9c-6e21d35003e7.htm
---
# Autodesk.Revit.DB.ParameterTypeId.CurtaingridUseCurveDistU Property

"Use Curve Distance"

## Syntax (C#)
```csharp
public static ForgeTypeId CurtaingridUseCurveDistU { get; }
```